


#+title: Variáveis e Tipos



#+author: Luigi D. C. Soares
#+email: <luigi.domenico@dcc.ufmg.br>

#+subtitle: Progamação e Desenvolvimento de Software I

#+date: DCC/UFMG (30/08/2022)

#+startup: beamer
#+options: H:1 num:t toc:nil \n:nil @:t ::t |:t ^:{} -:t f:t *:t <:t
#+options: TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+latex_class: beamer
#+latex_class_options: [t, aspectratio=169]
#+latex_header: \usepackage{tikz}
#+latex_header: \usetikzlibrary{calc, tikzmark}
#+latex_header: \usepackage{booktabs}
#+beamer_header: \title[Variáveis e Tipos]{Variáveis e Tipos}
#+beamer_header: \subtitle{Programação e Desenvolvimento de Software I}
#+beamer_header: \author[\tiny\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br]{%
#+beamer_header: Gleison S. D. Mendonça, Luigi D. C. Soares\texorpdfstring{\\}{}
#+beamer_header: \texttt{\{gleison.mendonca, luigi.domenico\}@dcc.ufmg.br}}
#+beamer_header: \institute[DCC/UFMG]{}
#+beamer_header: \date[30/08/2022]{}
#+beamer_header: %\usetheme{saori}
#+beamer_header: %\usemintedstyle{native}
#+beamer_header: \usetheme{ufmg}

* Variáveis

- Deve ser definida antes de ser utilizada: *\color{highlight}tipo_variável \color{blue!80}lista_de_variáveis*
#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    int x, y;
    x = 10;
    y = 20;
    printf("X: %d\n", x);
    printf("Y: %d\n", y);
    return 0;
}
#+end_src

#+RESULTS:
: X: 10
: Y: 20

* Tipos

- Diferentes tipos possuem tamanhos diferentes (em *bytes*, 1 byte = 8 bits)
- Tamanhos podem variar de acordo com o sistema

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    printf("Tamanho char: %d bytes\n", sizeof(char));
    printf("Tamanho short: %d bytes\n", sizeof(short));
    printf("Tamanho int: %d bytes\n", sizeof(int));
    printf("Tamanho long: %d bytes\n", sizeof(long));
    printf("Tamanho float: %d bytes\n", sizeof(float));
    printf("Tamanho double: %d bytes\n", sizeof(double));
    return 0;
}
#+end_src

#+RESULTS:
: Tamanho char: 1 bytes
: Tamanho short: 2 bytes
: Tamanho int: 4 bytes
: Tamanho long: 8 bytes
: Tamanho float: 4 bytes
: Tamanho double: 8 bytes

* Tipos

- Diferentes tipos possuem tamanhos diferentes (em *bytes*, 1 byte = 8 bits)
- Tamanhos podem variar de acordo com o sistema

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    printf("Tamanho long double: %d bytes\n", sizeof(long double));
    printf("Tamanho unsigned char: %d bytes\n", sizeof(unsigned char));
    printf("Tamanho unsigned short: %d bytes\n", sizeof(unsigned short));
    printf("Tamanho unsigned int: %d bytes\n", sizeof(unsigned int));
    printf("Tamanho unsigned long: %d bytes\n", sizeof(unsigned long));
    return 0;
}
#+end_src

#+RESULTS:
: Tamanho long double: 16 bytes
: Tamanho unsigned char: 1 bytes
: Tamanho unsigned short: 2 bytes
: Tamanho unsigned int: 4 bytes
: Tamanho unsigned long: 8 bytes


* Tipos

- Diferentes tipos possuem tamanhos diferentes (em *bytes*, 1 byte = 8 bits)
- Tamanhos podem variar de acordo com o sistema

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
#include <limits.h>
int main(int argc, char *argv[]) {
    printf("char: %d a %d\n", CHAR_MIN, CHAR_MAX);
    printf("short: %d a %d\n", SHRT_MIN, SHRT_MAX);
    printf("int: %d a %d\n", INT_MIN, INT_MAX);
    printf("long: %ld a %ld\n", LONG_MIN, LONG_MAX);
    return 0;
}
#+end_src

#+RESULTS:
: char: -128 a 127
: short: -32768 a 32767
: int: -2147483648 a 2147483647
: long: -9223372036854775808 a 9223372036854775807
: unsigned char: 0 a 255

* Tipos

- Diferentes tipos possuem tamanhos diferentes (em *bytes*, 1 byte = 8 bits)
- Tamanhos podem variar de acordo com o sistema

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
#include <limits.h>
#include <float.h>
int main(int argc, char *argv[]) {
    printf("unsigned char: %u a %u\n", 0, (unsigned int) UCHAR_MAX);
    printf("float: %e a %e\n", -FLT_MAX, FLT_MAX);
    printf("double: %e a %e\n", -DBL_MAX, DBL_MAX);
    return 0;
}
#+end_src

#+RESULTS:
: unsigned char: 0 a 255
: float: -3.402823e+38 a 3.402823e+38
: double: -1.797693e+308 a 1.797693e+308

* Comando de saída

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    printf("Inteiro: %d\n", 10);
    printf("Real: %f\n", 10.5);
    printf("Inteiro (long): %ld\n", 10 + 2);
    printf("Múltiplos valores: %d \t vs \t %f\n", 1, 3.14);
    printf("Caractere: %c\n", 'a');
    printf("String (sequência de caracteres): %s\n", "hello world");
    return 0;
}
#+end_src

#+RESULTS:
: Inteiro: 10
: Real: 10.500000
: Inteiro (long): 12
: Múltiplos valores: 1 	 vs 	 3.140000
: Caractere: a
: String (sequência de caracteres): hello world

* Comando de saída

#+attr_latex: :options frame=lines,framesep=2mm,linenos
#+begin_src C :exports code :results output
#include <stdio.h>
int main(int argc, char *argv[]) {
    // Inteiros com zeros a esquerda:
    printf("%08d\n", 10);
    // Formatação de casas decimais:
    printf("%.3f\n", 3.1415);
    // Notação científica:
    printf("%e\n", 32.1415);
    return 0;
}
#+end_src

#+RESULTS:
: 00000010
: 3.142
: 3.214150e+01

